{"optimizer": {"momentum": 0.0, "decay": 0.0, "lr": 0.10000000149011612, "name": "SGD", "nesterov": false}, "config": [{"config": {"b_constraint": null, "input_dim": 784, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "input_dtype": "float32", "activity_regularizer": null, "name": "dense_1", "trainable": true, "output_dim": 500, "bias": true, "b_regularizer": null, "batch_input_shape": [null, 784], "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "sigmoid"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "name": "dense_2", "trainable": true, "b_regularizer": null, "output_dim": 500, "bias": true, "W_constraint": null, "input_dim": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_2", "activation": "sigmoid"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "name": "dense_3", "trainable": true, "b_regularizer": null, "output_dim": 10, "bias": true, "W_constraint": null, "input_dim": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_3", "activation": "softmax"}, "class_name": "Activation"}], "sample_weight_mode": null, "loss": "mse", "keras_version": "1.0.6", "class_name": "Sequential"}